[
  {
    "path": "posts/2021_04_10_representation_revisited/",
    "title": "Representation revisited: a detailed assessment of ecosystem representation in the protected areas of the United States",
    "description": "Layering shapefiles and rasters, extracting data from rasters, joining data frames, creating webmaps",
    "author": [
      {
        "name": "Brandon Caltrider",
        "url": {}
      },
      {
        "name": "Myles Walimaa",
        "url": {}
      },
      {
        "name": "Randy Swaty",
        "url": {}
      }
    ],
    "date": "2021-04-12",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nSkills practiced in R\r\nBackground\r\nDatasets\r\nMethods\r\nDiscussion\r\n\r\nPresented at International Association of Landscape Ecology conference, April 2021.\r\nSkills practiced in R\r\nDefining a project question, developing methods, collecting data, performing analysis\r\nAccessing ESRI geodatabase layers (sf package)\r\nStacking and extracting raster values from shapefile boundaries (raster, sf packages)\r\nCleaning, joining, analyzing data frames (dplyr package)\r\nCreating charts (ggplot2 package)\r\nProducing interactive webmap (tmap package)\r\nFinal slideshow can be found here.This is an interactive map. It shows GAP status and ecosystem types for each Ecoregion (explained below). The layers can be toggled on/off on the upper left side, below the zoom controls. Note: the EVT raster was converted to lower resolution for mapping purposes. Explore away!\r\nBackground\r\nIn January 2021, the Biden administration announced that the United States will work toward the goal of conserving 30% of U.S. lands and oceans by 2030, also known as the “30 by 30” initiative.\r\n\r\n\r\n\r\nFigure 1: A snippet from the 30x30 initiative.\r\n\r\n\r\n\r\nEcologists and conservationists everywhere applauded this initiative as our careers are often devoted to protecting the natural systems that all life relies on. Brandon and I were also happy to hear this announcement, but as scientists we had questions lingering within our discussions:\r\nWhat do they mean by “conserving” land? Will these be untouched wilderness areas to protect biodiversity, or will they be protected from development but still logged?\r\nHow will they conserve land? Will they conserve sagebrush scrubland in Nevada and ignore the old-growth forests in Oregon, and call it “good”?\r\nHow do we currently define “conservation” in the United States?\r\nHow can we assess where we are at and how much more we have to go?\r\nDatasets\r\nThe Nature Conservancy Terrestrial Ecoregions, 2016\r\nDivides the country into geographic regions based on similar climate, vegetation, geology, and other ecological and environmental patterns.\r\nWe chose this dataset because it separates the country into regions based on ecological similarities rather than political boundaries.\r\nIt can be accessed here.\r\nUSGS Protected Areas Database of the United States 2.0, 2018\r\nA national inventory of the nation’s protected areas, including public land and private protected areas.\r\nWe chose this dataset because it is the most complete, credible resource available, plus it defines different rankings of ecological protection.\r\nGAP Status:\r\nLevel 1: Areas managed for biodiversity where natural disturbances are allowed to proceed.\r\nLevel 2: Areas managed for biodiversity where natural disturbance is suppressed.\r\nLevel 3: Areas protected from land conversion, but subject to extractive uses.\r\n\r\nIt can be accessed here.\r\nLANDFIRE Existing Vegetation Type 2.2.0, 2016\r\nShows the distribution of vegetative communities across the United States at 30 x 30 m resolution.\r\nWe chose this dataset because it is a detailed, yet broad, description of ecosystems across the country, which is perfect for identifying major ecosystems within an ecoregion.\r\nIt can be accessed here.\r\nMethods\r\nCropped the Ecoregion and Protected Areas Database (PADUS) shapefiles to the continental United States.\r\nExtracted Existing Vegetation Type (EVT) counts within each Ecoregion as a whole and displayed it as a data frame. Performed the same process on PADUS areas within each Ecoregion.\r\nJoined both datasets by Ecoregion. Summarized total acres and total acres protected at each GAP status.\r\nCalculated relative percentages of ecosystem conservation under three protection regimes: fully natural processes (GAP 1), prioritize biodiversity (GAP 1, 2), prevent land conversion (GAP 1, 2, 3).\r\nCalculated the relative percentages of EVTs occurring inside and outside protected areas of each Ecoregion, using 30% representation as the goal.\r\nDiscussion\r\n25.5% of land is protected from development or conversion, and more than half is subject to resource extraction.\r\n9.9% of land is protected for biodiversity purposes.\r\nOnly 4.2% of land is protected for biodiversity and allow for all natural ecological processes to occur.\r\n\r\n\r\n\r\nFigure 2: All protected lands in United States under each GAP status. Black dashed line is total percent protected under GAP 1, 2, 3 and red dashed line is our 30% goal.\r\n\r\n\r\n\r\n\r\n\r\nHow should we define “conservation” in the United States?\r\n\r\n\r\nIs it solely to prevent conversion to subdivisions or agriculture? Are we allowed to systematically extract resources from it, effectively disturbing natural regimes? If so, we have less than 5% to go.\r\nDo we prioritize biodiversity and prevent significant human impact from disrupting natural processes? If this is the avenue we take, we have about 20% more to go.\r\n\r\n\r\n\r\nFigure 3: This chart shows the percentage of ecosystem types (EVTs) that are in protected areas at 30% or greater representation under different conservation regimes (GAP status).\r\n\r\n\r\n\r\n\r\n\r\nIs it valuable to consider what types of land we choose to protect moving forward?\r\n\r\n\r\nBecause Biden’s plan is to conserve 30% of U.S. land, we decided that 30% of each ecosystem type should also be protected, in order to properly represent the ecosystems and their functions. This way, we don’t have 27% sagebrush, 2% northern hardwoods, 1% old growth conifer forest, and 0% oak savanna in our protected areas. How is that conservation?\r\n45.8% of EVTs are protected from land conversion at 30% or greater representation.\r\n22.6% of EVTs are protected for biodiversity at 30% or greater representation.\r\nThis is an interactive map. It shows GAP status and ecosystem types for each Ecoregion. The layers can be toggled on/off on the upper left side, below the zoom controls. Note: the EVT raster was converted to lower resolution for mapping purposes. Explore away!\r\n\r\n\r\n\r\n",
    "preview": "posts/2021_04_10_representation_revisited/conus_gap.png",
    "last_modified": "2022-10-23T13:53:01-06:00",
    "input_file": "rr.knit.md"
  },
  {
    "path": "posts/2019_11_27_driftless/",
    "title": "Rapid assessment of the Driftless Region",
    "description": "To familiarize one with QGIS and LANDFIRE",
    "author": [
      {
        "name": "Cole Bonino",
        "url": {}
      },
      {
        "name": "Myles Walimaa",
        "url": {}
      },
      {
        "name": "Randy Swaty",
        "url": {}
      }
    ],
    "date": "2019-11-27",
    "categories": [],
    "contents": "\r\nSkills practiced:\r\nDownloading and navigating the structure of LANDFIRE raster data\r\nRecoding rasters using R (dplyr, raster, sf packages)\r\nUsing QGIS to manage vector and raster files, edit symbology, add basemaps, and create a final layout\r\nThe full report can be found here.\r\nI had just gotten back from my first season at Isle Royale National Park - a long, arduous, fulfilling summer. My sister and I took three weeks and drove to Joshua Tree, King’s Canyon, Yosemite, and San Francisco. Upon returning to Marquette, I picked up a job at a ski hill for the winter, but also needed to continue working in science to some extent. I was re-introduced to Randy Swaty and became a member of the Conservation Data Lab.\r\nCole Bonino was a student at Northern Michigan University and was doing an internship with Randy. She developed a project idea and began researching her question, “How does the historical ecosystem patterns of the Driftless Region compare to the current ecosystem patterns?” The Driftless Region is 15.4 million acres of land at the crossroads of Wisconsin, Minnesota, Illinois, and Iowa that the glaciers avoided during the last ice age. Since there were no glaciers to flatten the landscape and deposit glacial drift (hence the name), the rolling landscape is a unique example of Midwest geography and ecology pre-ice age. Using the LANDFIRE BioPhysical Settings (BPS) data, she was able to construct a good idea of ecosystem distribution of the target area pre-colonization. LANDFIRE Existing Vegetation Type (EVT) data was used to assess the current ecosystem distribution.\r\nI tag-teamed with her to finish this project, as I had more GIS experience than she did (at the time). We wanted to display the changes that Driftless Region experienced before and after colonization. At this point I had lots of experience with ArcGIS Pro while in college, but had to find an alternative software since I no longer had an ESRI license after graduating. This is where I stumbled upon QGIS and began teaching myself this software. I reclassified (using R) the BPS raster into 5 broad categories: Oak and Pine, Prairie, Paleozoic Bluff and Talus, Mesophytic, and Riparian and Wetland. The same was performed to the EVT raster, with the addition of Ruderal and Plantation, and Agriculture and Development categories. Then I used QGIS to create cartographic maps.\r\nAs seen in the maps below, this region underwent quite a few changes since colonization. There are efforts to conserve and protect areas that remain untouched.\r\nThis project was presented to The Nature Conservancy in Madison, WI, in 2019.\r\nHistorical ecosystem coverage of the Driftless Region.Current ecosystem coverage of the Driftless region.\r\n\r\n\r\n",
    "preview": "posts/2019_11_27_driftless/bps_layout.jpg",
    "last_modified": "2022-10-23T12:55:10-06:00",
    "input_file": "driftless.knit.md"
  },
  {
    "path": "posts/2019_05_04_solar_radiation/",
    "title": "Analyzing trends in solar radiation over the Laurentian Great Lakes",
    "description": "Learning how to wrangle, process, and visualize data frames",
    "author": [
      {
        "name": "Myles Walimaa",
        "url": {}
      },
      {
        "name": "Norma Froelich",
        "url": {}
      },
      {
        "name": "John Lenters",
        "url": {}
      }
    ],
    "date": "2019-05-02",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nBackground\r\nMethods\r\nDiscussion\r\n\r\nSkills practiced:\r\nDeveloping research question and hypothesis, preparing literature review\r\nCollecting data from different sources\r\nConverting POSIX timestamp to date-time (lubridate package in R)\r\nWrangling, binding, summarizing large datasets - several million rows (dplyr package in R)\r\nPerforming statistical tests and producing charts (Kendall, ggplot2 packages in R)\r\nWriting a research report and creating a poster presentation\r\nFinal report can be found here.Presented at Northern Michigan University’s Celebration for Student Scholarship, April 2019. The first-place poster can be found here.\r\nBackground\r\nI was a student research assistant Summer-Fall 2018 with the Great Lakes Evaporation Network. NASA was installing some weather equipment on Granite Island (12 miles NW of Marquette) as part of their Clouds and Earth Radiant Energy System, so I assisted with installing this equipment. I learned that there is similar equipment on four other lighthouses on the Great Lakes. My research adviser John Lenters was explaining to me how solar radiation affects evaporation off the Great Lakes and since atmospheric aerosols (pollution, soot, smoke) are decreasing, the Earth’s surface is experiencing more solar radiation than it has in decades.\r\nSolar radiation primarily comes in two types:\r\nShortwave: Visible light and ultra-violet. Contains a lot of energy.\r\nLongwave: Infrared. Contains less energy, is experienced as heat.\r\nThis radiation is responsible for warming the earth day-to-day, providing plants with energy for photosynthesis, and giving us sunburn. The atmosphere absorbs some of this radiation and the more atmosphere it needs to travel through, the less radiation reaches the surface–the reason for the change of seasons in the northern/southern latitudes.\r\nStudies have shown that developing nations are experiencing less solar radiation on the surface than before they began industrialization. This can be attributed to the addition of atmospheric aerosols in the form of soot, smog, and other anthropogenic emissions. Similarly, wildfire smoke and volcanic ash cool the surface of the Earth when suspended in the atmosphere. These microscopic particles block some of the radiation from reaching the surface, and absorb and re-emit it as heat in the atmosphere. This concept is called global dimming. Additionally, water vapor relies on an atmospheric aerosol as a condensation nucleus for droplet and cloud formation.\r\n\r\n\r\n\r\nFigure 1: How aerosols affect the incoming solar radiation. Diagram from http://www.maceb.fi/climatic_impacts.html\r\n\r\n\r\n\r\nBecause aerosols warm the upper atmosphere, they are working together with the greenhouse effect to warm the planet. Coincidentally since the industrial revolution in the nineteenth century, we experienced the cooling effect of global dimming in conjunction with the warming effects, so there was little noticeable temperature change on the surface of the Earth.\r\nIn the 1970s, legislation was passed to combat air quality concerns impacting human health and environmental processes. As emissions decreased over a few decades, atmospheric aerosol concentrations decreased as well, called global brightening. We began experiencing the warming effects that the past century of industry produced–in both normal solar radiation levels and higher atmospheric temperatures–and realized that anthropogenic global warming is a real phenomenon.\r\nKnowing that solar radiation significantly affects water levels, I wondered is there a trend in global brightening across the Great Lakes region?\r\nMethods\r\nThe Great Lakes Evaporation Network was a recent initiative and radiation monitoring stations only had 3-6 years of data depending on location. By definition, climate trends are established over 30 year periods. The National Oceanic and Atmospheric Administration (NOAA) installed a solar radiation monitoring station in Bondeville, IL, in 1994. This was the closest and longest running monitoring station in the Great Lakes region.\r\n\r\n\r\n\r\nFigure 2: A map of the Great Lakes region, with the locations of the four Great Lakes Evaporation Network monitoring stations on each of the lakes, as well as the Bondeville station in Illinois.\r\n\r\n\r\n\r\nI used this 23-year period at Bondeville, IL, to determine solar radiation trends using the Mann-Kendall non-parametric test. The data was processed to yearly averages to determine long-term trends. This method was also used for Stannard Rock, MI, even though there was not a significant amount of data.\r\nThe 6-year data from Stannard Rock was compared to Bondeville to see if they behave similarly. The monthly solar radiation averages from Bondeville from 2011-2017 were compared as a ratio to Stannard Rock montlhy averages of the same time period.\r\nA linear regression was performed to determine whether the averages were diverging or converging, which would mean that the stations do not experience similar radiation patterns.\r\nDiscussion\r\nWith marginal significance (p = 0.055), the Bondeville station is “brighter” now that it was two decades ago.\r\n\r\n\r\n\r\nFigure 3: The yearly averages of solar radiation in Bondeville, IL, with a loess smoothing trendline to aid in visualization.\r\n\r\n\r\n\r\nThere is no significant trend at Stannard Rock, which was expected as only six years of data exist.\r\n\r\n\r\n\r\nFigure 4: The yearly averages of solar radiation at Stannard Rock, MI, with a linear trendline to aid in visualization.\r\n\r\n\r\n\r\nThe linear regression showed there is no significant trend in the ratio of monthly solar radiation averages between Bondeville and Stannard Rock, which suggests that both stations are experiencing similar radiation patterns.\r\n\r\n\r\n\r\nFigure 5: The ratio of monthly averages between Bondeville and Stannard Rock between 2011 and 2017.\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 6: A sinusoidal plot of monthly averages to visually compare the slopes over time. Stannard Rock’s values are lower due to it’s higher latitude. July 2014 is missing values.\r\n\r\n\r\n\r\nBecause Stannard Rock and Bondeville appear to experience similar solar radiation patterns, we can conclude that the Great Lakes are likely also brighter than they were 26 years ago. The White Shoal and Spectacle Reef in Lakes Michigan and Huron probably experience similar patterns as well.\r\nIn conjunction with higher atmospheric temperatures, increased solar radiation could have a significant impact on the Boreal Forest ecosystems of Northern Michigan due to water availability, climate sensitivity, and competitor migration (broadleaf hardwoods). While photosynthesis and carbon sequestration will increase, this benefit is likely short lived because of the sensitivity of boreal ecosystems.\r\nThis project certainly has limitations, primarily in the availability of long-term data. These are discussed in the final report.\r\n\r\n\r\n\r\n",
    "preview": "posts/2019_05_04_solar_radiation/stannard-rock.jpg",
    "last_modified": "2022-10-23T14:54:15-06:00",
    "input_file": "solar_radiation.knit.md"
  }
]
